Revit 2016 API
Workset.Create Method
 Creates a new workset.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Since: 2015 Subscription Update
Syntax
C#
public static Workset Create(
	Document document,
	string name
)
Visual Basic
Public Shared Function Create ( _
	document As Document, _
	name As String _
) As Workset
Visual C++
public:
static Workset^ Create(
	Document^ document,
	String^ name
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document in which the new instance is created.
name
Type: System.String
 The workset name.
Return Value
 Returns the newly created workset.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  document is not a workshared document. -or- name is an empty string or contains only whitespace. -or- name cannot include prohibited characters. -or- The given workset name is already in use.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
Autodesk.Revit.Exceptions.ModificationForbiddenException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process.
Autodesk.Revit.Exceptions.ModificationOutsideTransactionException |  The document has no open transaction.
See Also
Workset Class
Autodesk.Revit.DB Namespace